USE ShopDB
DROP TABLE Orders

CREATE TABLE Orders
(
	OrderID int NOT NULL,
	LineItem int NOT NULL,
	OrderDate date NOT NULL,
	CustFName varchar(15) NOT NULL,
	CustMName varchar(15) NOT NULL,
	CustLName varchar(15) NOT NULL,
	CustomerCity varchar(15),
	CustomerAddress varchar(25),
	Phone varchar(12) NOT NULL,
	ProductID char(5) NOT NULL,
	ProductDescription varchar(15),
	UnitPrice smallmoney NOT NULL,
	Qty int NOT NULL,
	TotalPrice money,
	EmpFName varchar(15) NOT NULL,
	EmpMName varchar(15) NOT NULL,
	EmpLName varchar(15) NOT NULL,

	CHECK (Phone LIKE '([0-9][0-9][0-9])[0-9][0-9][0-9][0-9][0-9][0-9][0-9]'),
	PRIMARY KEY (OrderId, LineItem)
)

INSERT Orders
VALUES
( 1,1,'2009-12-28',
 'Василий', 'Петрович', 'Лященко', 'Харьков', 'Лужная 15', '(092)3212211',
 'LV231', 'Джинсы', 45, 5, 225,
 'Иван', 'Иванович', 'Белецкий'),
  
( 1,2,'2009-12-28', 
 'Василий', 'Петрович', 'Лященко', 'Харьков', 'Лужная 15', '(092)3212211',
 'DG30', 'Ремень', 30, 5, 145,
 'Иван', 'Иванович', 'Белецкий'),
 
( 1,3, '2009-12-28', 
 'Василий', 'Петрович', 'Лященко', 'Харьков', 'Лужная 15', '(092)3212211',
 'LV12', 'Обувь', 26, 5, 125,
 'Иван', 'Иванович', 'Белецкий'),
 
( 2,1,'2010-09-01',
 'Зигмунд', 'Федорович', 'Унакий', 'Киев', 'Дегтяревская 5', '(092)7612343',
 'GC11', 'Шапка', 32, 10, 320, 
 'Светлана', 'Олеговна', 'Лялечкина'),
 
( 2,2, '2010-09-01',
 'Зигмунд', 'Федорович', 'Унакий', 'Киев', 'Дегтяревская 5', '(092)7612343',
 'GC111', 'Футболка', 20, 15, 300,
 'Светлана', 'Олеговна', 'Лялечкина'),

( 3,1,'2010-09-18',
 'Олег', 'Увстафьевич', 'Выжлецов', 'Чернигов', 'Киевская 5', '(044)2134212',
 'LV12', 'Обувь', 26, 20, 520, 
 'Светлана', 'Олеговна', 'Лялечкина'
 ),
 
( 3,2, '2010-09-18',
 'Олег', 'Увстафьевич', 'Выжлецов', 'Чернигов', 'Киевская 5', '(044)2134212',
 'GC11', 'Шапка', 32, 18, 576,
 'Светлана', 'Олеговна', 'Лялечкина'
 )

SELECT * FROM Orders